apache/nuttx/arch/arm/src/common/stm32/stm32_spi_m0_v1.c
static inline void spi_rx_mode(struct stm32_spidev_s *priv, bool enable)
{
  if (enable)
    {
      /* Enable RX */

      if (!priv->rx_mode)
        {
          /* Disable SPI */

          spi_modifycr(STM32_SPI_CR1_OFFSET, priv, 0, SPI_CR1_SPE);

          /* Disable output for half-duplex mode - SPI starts to
           * automatically output clocks.
           */

          spi_modifycr(STM32_SPI_CR1_OFFSET, priv, 0, SPI_CR1_BIDIOE);

          /* Enable SPI */

          spi_modifycr(STM32_SPI_CR1_OFFSET, priv, SPI_CR1_SPE, 0);

          priv->rx_mode = true;
        }
    }
  else
    {
      /* Enable TX */

      if (priv->rx_mode)
        {
          /* Disable SPI */

          spi_modifycr(STM32_SPI_CR1_OFFSET, priv, 0, SPI_CR1_SPE);

          /* Enable TX output */

          spi_modifycr(STM32_SPI_CR1_OFFSET, priv, SPI_CR1_BIDIOE, 0);

          /* Enable SPI */

          spi_modifycr(STM32_SPI_CR1_OFFSET, priv, SPI_CR1_SPE, 0);

          priv->rx_mode = false;
        }
    }
}

/****************************************************************************
 * Name: spi_getreg8
 *
 * Description:
 *   Get the contents of the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 8-bit register
 *
 ****************************************************************************/

#ifdef HAVE_IP_SPI_V2
static inline uint8_t spi_getreg8(struct stm32_spidev_s *priv,
                                  uint8_t offset)
{
  return getreg8(priv->spibase + offset);
}
#endif

/****************************************************************************
 * Name: spi_putreg8
 *
 * Description:
 *   Write a 8-bit value to the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *   value  - the 8-bit value to be written
 *
 ****************************************************************************/

#ifdef HAVE_IP_SPI_V2
static inline void spi_putreg8(struct stm32_spidev_s *priv,
                               uint8_t offset, uint8_t value)
{
  putreg8(value, priv->spibase + offset);
}
#endif

/****************************************************************************
 * Name: spi_readword
 *
 * Description:
 *   Read one word (TWO bytes!) from SPI
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *
 * Returned Value:
 *   Word as read
 *
 ****************************************************************************/

static inline uint16_t spi_readword(struct stm32_spidev_s *priv)
{
  /* Can't receive in tx only mode */

  if (priv->config == SIMPLEX_TX)
    {
      return 0;
    }

  if (priv->config == HALF_DUPLEX)
    {
      spi_rx_mode(priv, true);
    }

  /* Wait until the receive buffer is not empty */

  while ((spi_getreg(priv, STM32_SPI_SR_OFFSET) & SPI_SR_RXNE) == 0);

  if (priv->config == HALF_DUPLEX)
    {
      spi_rx_mode(priv, false);
    }

  /* Then return the received byte */

#ifdef HAVE_IP_SPI_V2
  if (priv->nbits < 9)
    {
      return (uint16_t)spi_getreg8(priv, STM32_SPI_DR_OFFSET);
    }
    else
#endif
    {
      return spi_getreg(priv, STM32_SPI_DR_OFFSET);
    }
}

/****************************************************************************
 * Name: spi_writeword
 *
 * Description:
 *   Write one 16-bit frame to the SPI FIFO
 *
 * Input Parameters:
 *   priv - Device-specific state data
 *   byte - Word to send
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void spi_writeword(struct stm32_spidev_s *priv,
                                 uint16_t word)
{
  /* Can't transmit in rx only mode */

  if (priv->config == SIMPLEX_RX)
    {
      return;
    }

  if (priv->config == HALF_DUPLEX)
    {
      spi_rx_mode(priv, false);
    }

  /* Wait until the transmit buffer is empty */

  while ((spi_getreg(priv, STM32_SPI_SR_OFFSET) & SPI_SR_TXE) == 0)
    {
    }

  /* Then send the word */

#ifdef HAVE_IP_SPI_V2
  /* "When the data frame size fits into one byte (less than or equal to 8
   *  bits), data packing is used automatically when any read or write 16-bit
   *  access is performed on the SPIx_DR register. The double data frame
   *  pattern is handled in parallel in this case. At first, the SPI operates
   *  using the pattern stored in the LSB of the accessed word, then with the
   *  other half stored in the MSB...
   *
   *  "A specific problem appears if an odd number of such "fit into one
   *   byte" data frames must be handled. On the transmitter side, writing
   *   the last data frame of any odd sequence with an 8-bit access to
   *   SPIx_DR is enough. ..."
   *
   * REVISIT: "...The receiver has to change the Rx_FIFO threshold level for
   * the last data frame received in the odd sequence of frames in order to
   * generate the RXNE event."
   */

  if (priv->nbits < 9)
    {
      spi_putreg8(priv, STM32_SPI_DR_OFFSET, (uint8_t)word);
    }
  else
#endif
    {
      spi_putreg(priv, STM32_SPI_DR_OFFSET, word);
    }

  if (priv->config == HALF_DUPLEX)
    {
      /* Wait for data transfer to be completed */

      while ((spi_getreg(priv, STM32_SPI_SR_OFFSET) & SPI_SR_BSY) != 0);
    }
}

/****************************************************************************
 * Name: spi_16bitmode
 *
 * Description:
 *   Check if the SPI is operating in 16-bit mode
 *
 * Input Parameters:
 *   priv     - Device-specific state data
 *
 * Returned Value:
 *   true: 16-bit mode, false: 8-bit mode
 *
 ****************************************************************************/

static inline bool spi_16bitmode(struct stm32_spidev_s *priv)
{
#ifdef HAVE_IP_SPI_V2
  return (priv->nbits > 8);
#else
  return ((spi_getreg(priv, STM32_SPI_CR1_OFFSET) & SPI_CR1_DFF) != 0);
#endif
}

/****************************************************************************
 * Name: spi_dmarxwait
 *
 * Description:
 *   Wait for DMA to complete.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_SPI_DMA
static int spi_dmarxwait(struct stm32_spidev_s *priv)
{
  int ret;

