apache/nuttx/arch/arm/src/common/stm32/stm32_spi_m0_v1.c
      if (!priv->initialized)
        {
          /* Configure SPI1 pins: SCK, MISO, and MOSI */

          stm32_configgpio(GPIO_SPI1_SCK);
          stm32_configgpio(GPIO_SPI1_MOSI);

          if (priv->config == FULL_DUPLEX || priv->config == SIMPLEX_RX)
            {
              stm32_configgpio(GPIO_SPI1_MISO);
            }
        }
    }
  else
#endif
#ifdef CONFIG_STM32_SPI2
  if (bus == 2)
    {
      /* Select SPI2 */

      priv = &g_spi2dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Configure SPI2 pins: SCK, MISO, and MOSI */

          stm32_configgpio(GPIO_SPI2_SCK);
          stm32_configgpio(GPIO_SPI2_MOSI);

          if (priv->config == FULL_DUPLEX || priv->config == SIMPLEX_RX)
            {
              stm32_configgpio(GPIO_SPI2_MISO);
            }
        }
    }
  else
#endif
#ifdef CONFIG_STM32_SPI3
  if (bus == 3)
    {
      /* Select SPI3 */

      priv = &g_spi3dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Configure SPI3 pins: SCK, MISO, and MOSI */

          stm32_configgpio(GPIO_SPI3_SCK);
          stm32_configgpio(GPIO_SPI3_MOSI);

          if (priv->config == FULL_DUPLEX || priv->config == SIMPLEX_RX)
            {
              stm32_configgpio(GPIO_SPI3_MISO);
            }
        }
    }
  else
#endif
    {
      spierr("ERROR: Unsupported SPI bus: %d\n", bus);
      priv = NULL;
      goto errout;
    }

#ifdef CONFIG_STM32_SPI_DMA
  /* SPI DMA supported only for full-duplex mode */

  if (priv->rxch && priv->txch && priv->config != FULL_DUPLEX)
    {
      priv = NULL;
      spierr("ERROR: SPI DMA supported only for full duplex mode\n");
      goto errout;
    }
#endif

  /* Set up default configuration: Master, 8-bit, etc. */

  spi_bus_initialize(priv);
  priv->initialized = true;

errout:
  leave_critical_section(flags);
  return (struct spi_dev_s *)priv;
}

#endif /* CONFIG_STM32_SPI */
